In [1]:
# Importing libraries
import pandas as pd
from datasets import load_dataset
import matplotlib.pyplot as plt

# Loading Data
dataset = load_dataset('lukebarousse/data_jobs')
df = dataset['train'].to_pandas()

# Data Cleanup
df['job_posted_date'] = pd.to_datetime(df['job_posted_date'])

c:\Users\willh\anaconda3\envs\python_project\Lib\site-packages\tqdm\auto.py:21: TqdmWarning: IProgress not found. Please update jupyter and ipywidgets. See https://ipywidgets.readthedocs.io/en/stable/user_install.html
  from .autonotebook import tqdm as notebook_tqdm

In [3]:
# Collecting median salaries in order to fill in NA values for later analysis
median_salary_year = df['salary_year_avg'].median()

median_salary_hour = df['salary_hour_avg'].median()

In [ ]:
# Creating new dataframe for modification
df_filled = df

df_filled['salary_year_avg'] = df_filled['salary_year_avg'].fillna(median_salary_year)

df_filled['salary_hour_avg'] = df_filled['salary_hour_avg'].fillna(median_salary_hour)

In [ ]:
# Making sure replacing NA values was successful
df_filled.loc[:10, 'salary_year_avg':'salary_hour_avg']

    salary_year_avg  salary_hour_avg
0          115000.0            45.98
1          115000.0            45.98
2          115000.0            45.98
3          115000.0            45.98
4          115000.0            45.98
5          115000.0            45.98
6          115000.0            45.98
7          115000.0            45.98
8          115000.0            45.98
9          115000.0            45.98
10         115000.0            45.98

In [ ]:
# Creating another new dataframe with duplicate job postings removed
df_unique = df_filled

df_unique = df_unique.drop_duplicates()

print('Length of original df:', len(df_filled) )
print('Length of unique df:', len(df_unique))
print('Number of duplicate rows:', len(df_filled) - len(df_unique))

Length of original df: 785741
Length of unique df: 785640
Number of duplicate rows: 101

In [ ]:
# Dropping duplicates based on job title and company only

df_unique = df_unique.drop_duplicates(subset= ['job_title', 'company_name'])

print('Length of original df:', len(df_filled) )
print('Length of unique df:', len(df_unique))
print('Number of duplicate rows:', len(df_filled) - len(df_unique))

Length of original df: 785741
Length of unique df: 508042
Number of duplicate rows: 277699